       01 WS-ENR-UTILISATEUR    OCCURS 12 TIMES.
           05 WS-ID-UTILISATEUR          PIC X(10).
           05 WS-NOM-UTILISATEUR         PIC X(50).
           05 WS-EMAIL-UTILISATEUR       PIC X(30).
           05 WS-RETURN-CODE             PIC S9(04).
